#0. Google Drive Mounting

In [1]:
from google.colab import drive
drive.mount('/gdrive')

Mounted at /gdrive

In [27]:
!ls -al '/gdrive/My Drive/data'

total 23238
-rw------- 1 root root 9373601 May 13 03:46 marathon_2015_2017.csv
-rw------- 1 root root 1750754 Feb 22 17:41 marathon_2015_2017_qualifying.csv
-rw------- 1 root root    1349 Aug 19  2019 marathon_qualifying_time.csv
-rw------- 1 root root 4228123 Apr 29  2017 marathon_results_2015.csv
-rw------- 1 root root 4244383 Apr 29  2017 marathon_results_2016.csv
-rw------- 1 root root 4196246 Apr 29  2017 marathon_results_2017.csv

#Step 1. Read Files

In [3]:
# Import pandas as a alias 'pd'
import pandas as pd

In [4]:
# Load the CSV files "marathon_results_2015 ~ 2017.csv" under "data" folder
marathon_2015 = pd.read_csv('/gdrive/My Drive/data/marathon_results_2015.csv')
marathon_2016 = pd.read_csv('/gdrive/My Drive/data/marathon_results_2016.csv')
marathon_2017 = pd.read_csv('/gdrive/My Drive/data/marathon_results_2017.csv')

In [8]:
marathon_2017.head()

   Unnamed: 0 Bib              Name  ...  Overall Gender Division
0           0  11   Kirui, Geoffrey  ...        1      1        1
1           1  17       Rupp, Galen  ...        2      2        2
2           2  23     Osako, Suguru  ...        3      3        3
3           3  21  Biwott, Shadrack  ...        4      4        4
4           4   9    Chebet, Wilson  ...        5      5        5

[5 rows x 25 columns]

In [11]:
marathon_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26410 entries, 0 to 26409
Data columns (total 25 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     26410 non-null  int64
 1   Bib            26410 non-null  object
 2   Name           26410 non-null  object
 3   Age            26410 non-null  int64
 4   M/F            26410 non-null  object
 5   City           26410 non-null  object
 6   State          22815 non-null  object
 7   Country        26410 non-null  object
 8   Citizen        1254 non-null   object
 9   Unnamed: 9     91 non-null     object
 10  5K             26410 non-null  object
 11  10K            26410 non-null  object
 12  15K            26410 non-null  object
 13  20K            26410 non-null  object
 14  Half           26410 non-null  object
 15  25K            26410 non-null  object
 16  30K            26410 non-null  object
 17  35K            26410 non-null  object
 18  40K            26410 non-null  object
 19  Pace           26410 non-null  object
 20  Proj Time      26410 non-null  object
 21  Official Time  26410 non-null  object
 22  Overall        26410 non-null  int64
 23  Gender         26410 non-null  int64
 24  Division       26410 non-null  int64
dtypes: int64(5), object(20)
memory usage: 5.0+ MB

#Step 2. Add Year column

In [12]:
# Add Year column to the CSV files "marathon_results_2015 ~ 2017.csv"
marathon_2015['Year'] = '2015'
marathon_2016['Year'] = '2016'
marathon_2017['Year'] = '2017'

In [15]:
marathon_2017.head()

   Unnamed: 0 Bib              Name  Age  ... Overall Gender Division  Year
0           0  11   Kirui, Geoffrey   24  ...       1      1        1  2017
1           1  17       Rupp, Galen   30  ...       2      2        2  2017
2           2  23     Osako, Suguru   25  ...       3      3        3  2017
3           3  21  Biwott, Shadrack   32  ...       4      4        4  2017
4           4   9    Chebet, Wilson   31  ...       5      5        5  2017

[5 rows x 26 columns]

#Step 3. Merge Files

In [16]:
# Merge 2015, 2016 and 2017 files into marathon_2015_2017 file
marathon_2015_2017 = pd.concat([marathon_2015, marathon_2016, marathon_2017], ignore_index=True, sort=False)

In [17]:
marathon_2015_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79638 entries, 0 to 79637
Data columns (total 27 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     53008 non-null  float64
 1   Bib            79638 non-null  object
 2   Name           79638 non-null  object
 3   Age            79638 non-null  int64
 4   M/F            79638 non-null  object
 5   City           79637 non-null  object
 6   State          70645 non-null  object
 7   Country        79638 non-null  object
 8   Citizen        3440 non-null   object
 9   Unnamed: 9     158 non-null    object
 10  5K             79638 non-null  object
 11  10K            79638 non-null  object
 12  15K            79638 non-null  object
 13  20K            79638 non-null  object
 14  Half           79638 non-null  object
 15  25K            79638 non-null  object
 16  30K            79638 non-null  object
 17  35K            79638 non-null  object
 18  40K            79638 non-null  object
 19  Pace           79638 non-null  object
 20  Proj Time      79638 non-null  object
 21  Official Time  79638 non-null  object
 22  Overall        79638 non-null  int64
 23  Gender         79638 non-null  int64
 24  Division       79638 non-null  int64
 25  Year           79638 non-null  object
 26  Unnamed: 8     83 non-null     object
dtypes: float64(1), int64(4), object(22)
memory usage: 16.4+ MB

#Step 4. Drop columns

In [18]:
#Drop unnecessary columns 
marathon_2015_2017 = marathon_2015_2017.drop(['Unnamed: 0','Bib', 'Citizen', 'Unnamed: 9', 'Proj Time', 'Unnamed: 8'], axis='columns')

In [19]:
marathon_2015_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79638 entries, 0 to 79637
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           79638 non-null  object
 1   Age            79638 non-null  int64
 2   M/F            79638 non-null  object
 3   City           79637 non-null  object
 4   State          70645 non-null  object
 5   Country        79638 non-null  object
 6   5K             79638 non-null  object
 7   10K            79638 non-null  object
 8   15K            79638 non-null  object
 9   20K            79638 non-null  object
 10  Half           79638 non-null  object
 11  25K            79638 non-null  object
 12  30K            79638 non-null  object
 13  35K            79638 non-null  object
 14  40K            79638 non-null  object
 15  Pace           79638 non-null  object
 16  Official Time  79638 non-null  object
 17  Overall        79638 non-null  int64
 18  Gender         79638 non-null  int64
 19  Division       79638 non-null  int64
 20  Year           79638 non-null  object
dtypes: int64(4), object(17)
memory usage: 12.8+ MB

#Step 5. Convert columns value

In [20]:
# Import Numpy Library and call it as np
import numpy as np

In [21]:
# Convert using pandas to_timedelta method
marathon_2015_2017['5K'] = pd.to_timedelta(marathon_2015_2017['5K'])
marathon_2015_2017['10K'] = pd.to_timedelta(marathon_2015_2017['10K'])
marathon_2015_2017['15K'] = pd.to_timedelta(marathon_2015_2017['15K'])
marathon_2015_2017['20K'] = pd.to_timedelta(marathon_2015_2017['20K'])
marathon_2015_2017['Half'] = pd.to_timedelta(marathon_2015_2017['Half'])
marathon_2015_2017['25K'] = pd.to_timedelta(marathon_2015_2017['25K'])
marathon_2015_2017['30K'] = pd.to_timedelta(marathon_2015_2017['30K'])
marathon_2015_2017['35K'] = pd.to_timedelta(marathon_2015_2017['35K'])
marathon_2015_2017['40K'] = pd.to_timedelta(marathon_2015_2017['40K'])
marathon_2015_2017['Pace'] = pd.to_timedelta(marathon_2015_2017['Pace'])
marathon_2015_2017['Official Time'] = pd.to_timedelta(marathon_2015_2017['Official Time'])

In [22]:
marathon_2015_2017.head()

                    Name  Age M/F         City  ... Overall Gender Division  Year
0         Desisa, Lelisa   25   M         Ambo  ...       1      1        1  2015
1  Tsegay, Yemane Adhane   30   M  Addis Ababa  ...       2      2        2  2015
2         Chebet, Wilson   29   M     Marakwet  ...       3      3        3  2015
3       Kipyego, Bernard   28   M      Eldoret  ...       4      4        4  2015
4          Korir, Wesley   32   M       Kitale  ...       5      5        5  2015

[5 rows x 21 columns]

In [23]:
marathon_2015_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79638 entries, 0 to 79637
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           79638 non-null  object
 1   Age            79638 non-null  int64
 2   M/F            79638 non-null  object
 3   City           79637 non-null  object
 4   State          70645 non-null  object
 5   Country        79638 non-null  object
 6   5K             79638 non-null  timedelta64[ns]
 7   10K            79638 non-null  timedelta64[ns]
 8   15K            79638 non-null  timedelta64[ns]
 9   20K            79638 non-null  timedelta64[ns]
 10  Half           79638 non-null  timedelta64[ns]
 11  25K            79638 non-null  timedelta64[ns]
 12  30K            79638 non-null  timedelta64[ns]
 13  35K            79638 non-null  timedelta64[ns]
 14  40K            79638 non-null  timedelta64[ns]
 15  Pace           79638 non-null  timedelta64[ns]
 16  Official Time  79638 non-null  timedelta64[ns]
 17  Overall        79638 non-null  int64
 18  Gender         79638 non-null  int64
 19  Division       79638 non-null  int64
 20  Year           79638 non-null  object
dtypes: int64(4), object(6), timedelta64[ns](11)
memory usage: 12.8+ MB

In [24]:
# Convert time to seconds value using astype method
marathon_2015_2017['5K'] = marathon_2015_2017['5K'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['10K'] = marathon_2015_2017['10K'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['15K'] = marathon_2015_2017['15K'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['20K'] = marathon_2015_2017['20K'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['Half'] = marathon_2015_2017['Half'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['25K'] = marathon_2015_2017['25K'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['30K'] = marathon_2015_2017['30K'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['35K'] = marathon_2015_2017['35K'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['40K'] = marathon_2015_2017['40K'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['Pace'] = marathon_2015_2017['Pace'].astype('m8[s]').astype(np.int64)
marathon_2015_2017['Official Time'] = marathon_2015_2017['Official Time'].astype('m8[s]').astype(np.int64)

In [25]:
marathon_2015_2017.head()

                    Name  Age M/F         City  ... Overall Gender  Division  Year
0         Desisa, Lelisa   25   M         Ambo  ...       1      1         1  2015
1  Tsegay, Yemane Adhane   30   M  Addis Ababa  ...       2      2         2  2015
2         Chebet, Wilson   29   M     Marakwet  ...       3      3         3  2015
3       Kipyego, Bernard   28   M      Eldoret  ...       4      4         4  2015
4          Korir, Wesley   32   M       Kitale  ...       5      5         5  2015

[5 rows x 21 columns]

#Step 6. Save file

In [26]:
# Save to CSV file "marathon_2015_2017.csv"
output_file = '/gdrive/My Drive/data/marathon_2015_2017.csv'
marathon_2015_2017.to_csv(output_file, index=None, header=True)